<a href="https://colab.research.google.com/github/smitesh95/Python/blob/main/Data_cleaning_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [ ]:
1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.fillna(value=0,inplace=True)

In [5]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           0.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           0.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [7]:
for i in range(5):
    if df['FlightNumber'].loc[i]==0:
        a=df['FlightNumber'].loc[i-1]
        print(a+10)
    else:
        print(df['FlightNumber'].loc[i])

10045.0
10055.0
10065.0
10075.0
10085.0

In [8]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [9]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [ ]:
2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [10]:
new=df['From_To'].str.split("_",expand=True)

In [11]:
new[0]

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: 0, dtype: object

In [12]:
df['From']=new[0]

In [13]:
df['To']=new[1]

In [14]:
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN             0  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis             0  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

In [ ]:
3.Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. 
Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [15]:
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN             0  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis             0  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

In [16]:
for i in df.From:
    df['From']=i.title()
for j in df.To:
    df['To']=j.title()
df

            From_To  FlightNumber  ...    From     To
0      LoNDon_paris         10045  ...  London  Paris
1      MAdrid_miLAN             0  ...  London  Paris
2  londON_StockhOlm         10065  ...  London  Paris
3    Budapest_PaRis             0  ...  London  Paris
4   Brussels_londOn         10085  ...  London  Paris

[5 rows x 6 columns]

In [ ]:
4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [17]:
df.drop(columns='From_To',inplace=True)
df

   FlightNumber  RecentDelays              Airline    From     To
0         10045      [23, 47]               KLM(!)  London  Paris
1             0            []    <Air France> (12)  London  Paris
2         10065  [24, 43, 87]  (British Airways. )  London  Paris
3             0          [13]       12. Air France  London  Paris
4         10085      [67, 32]          "Swiss Air"  London  Paris

In [ ]:
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [18]:
df['RecentDelays'].loc[0]=[23,47,np.nan]
df['RecentDelays'].loc[1]=[np.nan,np.nan,np.nan]
df['RecentDelays'].loc[3]=[13,np.nan,np.nan]
df['RecentDelays'].loc[4]=[67,32,np.nan]

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [29]:
l=[]
for i in range(5):
    a=df['RecentDelays'].loc[i]
    l.append(a[2])
l
for i in l:
    df['Delay_3']=l

l.clear()

In [30]:
df

   FlightNumber     RecentDelays  ... Delay_2 Delay_3
0         10045    [23, 47, nan]  ...    47.0     NaN
1             0  [nan, nan, nan]  ...     NaN     NaN
2         10065     [24, 43, 87]  ...    43.0    87.0
3             0   [13, nan, nan]  ...     NaN     NaN
4         10085    [67, 32, nan]  ...    32.0     NaN

[5 rows x 8 columns]